app/views/elastic/admin/sections/section_form.html.erb

					<td> <%= cc.contents.size %> </td>
	        <td> <%= f2.select :form, Elastic::ContentConfig::FORMS.keys %></td>
---
SELECT `elastic_content_configs`.* FROM `elastic_content_configs` WHERE (`elastic_content_configs`.`section_id` = 1) ORDER BY position DESC LIMIT 1