app/controllers/elastic/admin/sections_controller.rb

    def cc_toggle_published
      @content_config.toggle_published!
---
UPDATE `elastic_content_configs` SET `is_published` = 1, `updated_at` = '2012-04-30 12:24:07', `meta` = '--- !!null \n...\n' WHERE `elastic_content_configs`.`id` = 1